app/Services/CategoryService.php

    public function getAllCategories()
    {
        return Category::all();
---
select * from `categories`