app/Services/ProductService.php

    public function getAllByCategoryNameAndOption($category, $option, $limit)
    {
        return Product::with('categories', 'images', 'options')->whereHas('categories', function ($q) use ($category) {
            $q->where('slug', $category);
        })->whereHas('options', function ($q) use ($option) {
            $q->where('is_on_auction', $option)->where('auction_final_date', '>=', date("Y-m-d H:i:s"));
        })->where('status', 1)->orderBy('created_at', 'desc')->paginate($limit);
---
select count(*) as aggregate from `products` where exists (select * from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `products`.`id` = `category_product`.`product_id` and `slug` = 'featured') and exists (select * from `product_options` where `products`.`id` = `product_options`.`product_id` and `is_on_auction` = 1 and `auction_final_date` >= '2020-03-16 20:01:56') and `status` = 1

    public function getAllByProductOption($productOption, $limit)
    {
        return Product::with('categories', 'images', 'options')->whereHas('options', function ($q) use ($productOption) {
            $q->where('is_on_auction', $productOption);
        })->where('status', '!=', 0)->orderBy('created_at', 'desc')->paginate($limit);
---
select count(*) as aggregate from `products` where exists (select * from `product_options` where `products`.`id` = `product_options`.`product_id` and `is_on_auction` = 0) and `status` != 0

    public function getAvailableProductsByProductOption($productOption, $limit)
    {
        return Product::with('categories', 'images', 'options')->whereHas('options', function ($q) use ($productOption) {
            $q->where('is_on_auction', $productOption)->where('auction_final_date', '>=', date("Y-m-d H:i:s"));
        })->where('status', 1)->where('created_at', '<=', date("Y-m-d H:i:s"))->orderBy('created_at', 'desc')->paginate($limit);
---
select count(*) as aggregate from `products` where exists (select * from `product_options` where `products`.`id` = `product_options`.`product_id` and `is_on_auction` = 1 and `auction_final_date` >= '2020-03-16 20:01:56') and `status` = 1 and `created_at` <= '2020-03-16 20:01:56'